garyPenhook/PIC-Assembler/device_includes/pic16f18156.inc
#define DLEN3                            BANKMASK(CRCCON2), 3
#define DLEN4                            BANKMASK(CRCCON2), 4
#define DOE                              BANKMASK(CPUDOZE), 4
#define DONE                             BANKMASK(ADCON0), 0
#define DOZE0                            BANKMASK(CPUDOZE), 0
#define DOZE1                            BANKMASK(CPUDOZE), 1
#define DOZE2                            BANKMASK(CPUDOZE), 2
#define DOZEN                            BANKMASK(CPUDOZE), 6
#define DSEN                             BANKMASK(ADCON1), 0
#define D_A1                             BANKMASK(SSP1STAT), 5
#define D_A2                             BANKMASK(SSP2STAT), 5
#define D_nA1                            BANKMASK(SSP1STAT), 5
#define D_nA2                            BANKMASK(SSP2STAT), 5
#define ERR0                             BANKMASK(ADERRL), 0
#define ERR1                             BANKMASK(ADERRL), 1
#define ERR10                            BANKMASK(ADERRH), 2
#define ERR11                            BANKMASK(ADERRH), 3
#define ERR12                            BANKMASK(ADERRH), 4
#define ERR13                            BANKMASK(ADERRH), 5
#define ERR14                            BANKMASK(ADERRH), 6
#define ERR15                            BANKMASK(ADERRH), 7
#define ERR2                             BANKMASK(ADERRL), 2
#define ERR3                             BANKMASK(ADERRL), 3
#define ERR4                             BANKMASK(ADERRL), 4
#define ERR5                             BANKMASK(ADERRL), 5
#define ERR6                             BANKMASK(ADERRL), 6
#define ERR7                             BANKMASK(ADERRL), 7
#define ERR8                             BANKMASK(ADERRH), 0
#define ERR9                             BANKMASK(ADERRH), 1
#define EXTOEN                           BANKMASK(OSCEN), 7
#define EXTOR                            BANKMASK(OSCSTAT), 7
#define FLTR0                            BANKMASK(ADFLTRL), 0
#define FLTR1                            BANKMASK(ADFLTRL), 1
#define FLTR10                           BANKMASK(ADFLTRH), 2
#define FLTR11                           BANKMASK(ADFLTRH), 3
#define FLTR12                           BANKMASK(ADFLTRH), 4
#define FLTR13                           BANKMASK(ADFLTRH), 5
#define FLTR14                           BANKMASK(ADFLTRH), 6
#define FLTR15                           BANKMASK(ADFLTRH), 7
#define FLTR2                            BANKMASK(ADFLTRL), 2
#define FLTR3                            BANKMASK(ADFLTRL), 3
#define FLTR4                            BANKMASK(ADFLTRL), 4
#define FLTR5                            BANKMASK(ADFLTRL), 5
#define FLTR6                            BANKMASK(ADFLTRL), 6
#define FLTR7                            BANKMASK(ADFLTRL), 7
#define FLTR8                            BANKMASK(ADFLTRH), 0
#define FLTR9                            BANKMASK(ADFLTRH), 1
#define FM0                              BANKMASK(ADCON0), 2
#define FM1                              BANKMASK(ADCON0), 3
#define FREE                             BANKMASK(NVMCON1), 4
#define FRQ0                             BANKMASK(OSCFRQ), 0
#define FRQ1                             BANKMASK(OSCFRQ), 1
#define FRQ2                             BANKMASK(OSCFRQ), 2
#define FULL                             BANKMASK(CRCCON0), 0
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRMD                            BANKMASK(PMD3), 5
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1D1N                            BANKMASK(CLCnGLS0), 0
#define G1D1T                            BANKMASK(CLCnGLS0), 1
#define G1D2N                            BANKMASK(CLCnGLS0), 2
#define G1D2T                            BANKMASK(CLCnGLS0), 3
#define G1D3N                            BANKMASK(CLCnGLS0), 4
#define G1D3T                            BANKMASK(CLCnGLS0), 5
#define G1D4N                            BANKMASK(CLCnGLS0), 6
#define G1D4T                            BANKMASK(CLCnGLS0), 7
#define G1EN                             BANKMASK(CWG1CON0), 7
#define G1POL                            BANKMASK(CLCnPOL), 0
#define G2D1N                            BANKMASK(CLCnGLS1), 0
#define G2D1T                            BANKMASK(CLCnGLS1), 1
#define G2D2N                            BANKMASK(CLCnGLS1), 2
#define G2D2T                            BANKMASK(CLCnGLS1), 3
#define G2D3N                            BANKMASK(CLCnGLS1), 4
#define G2D3T                            BANKMASK(CLCnGLS1), 5
#define G2D4N                            BANKMASK(CLCnGLS1), 6
#define G2D4T                            BANKMASK(CLCnGLS1), 7
#define G2POL                            BANKMASK(CLCnPOL), 1
#define G3D1N                            BANKMASK(CLCnGLS2), 0
#define G3D1T                            BANKMASK(CLCnGLS2), 1
#define G3D2N                            BANKMASK(CLCnGLS2), 2
#define G3D2T                            BANKMASK(CLCnGLS2), 3
#define G3D3N                            BANKMASK(CLCnGLS2), 4
#define G3D3T                            BANKMASK(CLCnGLS2), 5
#define G3D4N                            BANKMASK(CLCnGLS2), 6
#define G3D4T                            BANKMASK(CLCnGLS2), 7
#define G3POL                            BANKMASK(CLCnPOL), 2
#define G4D1N                            BANKMASK(CLCnGLS3), 0
#define G4D1T                            BANKMASK(CLCnGLS3), 1
#define G4D2N                            BANKMASK(CLCnGLS3), 2
#define G4D2T                            BANKMASK(CLCnGLS3), 3
#define G4D3N                            BANKMASK(CLCnGLS3), 4
#define G4D3T                            BANKMASK(CLCnGLS3), 5
#define G4D4N                            BANKMASK(CLCnGLS3), 6
#define G4D4T                            BANKMASK(CLCnGLS3), 7
#define G4POL                            BANKMASK(CLCnPOL), 3
#define GCEN1                            BANKMASK(SSP1CON2), 7
#define GCEN2                            BANKMASK(SSP2CON2), 7
#define GIE                              BANKMASK(INTCON), 7
#define GO_nDONE                         BANKMASK(ADCON0), 0
#define HFOEN                            BANKMASK(OSCEN), 6
#define HFOR                             BANKMASK(OSCSTAT), 6
#define I2C_DAT1                         BANKMASK(SSP1STAT), 5
#define I2C_DAT2                         BANKMASK(SSP2STAT), 5
#define I2C_READ1                        BANKMASK(SSP1STAT), 2
#define I2C_READ2                        BANKMASK(SSP2STAT), 2
#define I2C_START1                       BANKMASK(SSP1STAT), 3
#define I2C_START2                       BANKMASK(SSP2STAT), 3
#define IC                               BANKMASK(ADCON0), 1
#define IDLEN                            BANKMASK(CPUDOZE), 7
#define IN                               BANKMASK(CWG1CON1), 5
#define INC0                             BANKMASK(NCO1INCL), 0
#define INC1                             BANKMASK(NCO1INCL), 1
#define INC10                            BANKMASK(NCO1INCH), 2
#define INC11                            BANKMASK(NCO1INCH), 3
#define INC12                            BANKMASK(NCO1INCH), 4
#define INC13                            BANKMASK(NCO1INCH), 5
#define INC14                            BANKMASK(NCO1INCH), 6
#define INC15                            BANKMASK(NCO1INCH), 7
#define INC16                            BANKMASK(NCO1INCU), 0
#define INC17                            BANKMASK(NCO1INCU), 1
#define INC18                            BANKMASK(NCO1INCU), 2
#define INC19                            BANKMASK(NCO1INCU), 3
#define INC2                             BANKMASK(NCO1INCL), 2
#define INC3                             BANKMASK(NCO1INCL), 3
#define INC4                             BANKMASK(NCO1INCL), 4
#define INC5                             BANKMASK(NCO1INCL), 5
#define INC6                             BANKMASK(NCO1INCL), 6
#define INC7                             BANKMASK(NCO1INCL), 7
#define INC8                             BANKMASK(NCO1INCH), 0
#define INC9                             BANKMASK(NCO1INCH), 1
#define INLVLA0                          BANKMASK(INLVLA), 0
#define INLVLA1                          BANKMASK(INLVLA), 1
#define INLVLA2                          BANKMASK(INLVLA), 2
#define INLVLA3                          BANKMASK(INLVLA), 3
#define INLVLA4                          BANKMASK(INLVLA), 4
#define INLVLA5                          BANKMASK(INLVLA), 5
#define INLVLA6                          BANKMASK(INLVLA), 6
#define INLVLA7                          BANKMASK(INLVLA), 7
#define INLVLB0                          BANKMASK(INLVLB), 0
#define INLVLB1                          BANKMASK(INLVLB), 1
#define INLVLB2                          BANKMASK(INLVLB), 2
#define INLVLB3                          BANKMASK(INLVLB), 3
#define INLVLB4                          BANKMASK(INLVLB), 4
#define INLVLB5                          BANKMASK(INLVLB), 5
#define INLVLB6                          BANKMASK(INLVLB), 6
#define INLVLB7                          BANKMASK(INLVLB), 7
#define INLVLC0                          BANKMASK(INLVLC), 0
#define INLVLC1                          BANKMASK(INLVLC), 1
#define INLVLC2                          BANKMASK(INLVLC), 2
#define INLVLC3                          BANKMASK(INLVLC), 3
#define INLVLC4                          BANKMASK(INLVLC), 4
#define INLVLC5                          BANKMASK(INLVLC), 5
#define INLVLC6                          BANKMASK(INLVLC), 6
#define INLVLC7                          BANKMASK(INLVLC), 7
#define INLVLE3                          BANKMASK(INLVLE), 3
#define INTE                             BANKMASK(PIE0), 0
#define INTEDG                           BANKMASK(INTCON), 0
#define INTF                             BANKMASK(PIR0), 0
#define INTM                             BANKMASK(SCANCON0), 3
#define INTPPS0                          BANKMASK(INTPPS), 0
#define INTPPS1                          BANKMASK(INTPPS), 1
#define INTPPS2                          BANKMASK(INTPPS), 2
#define INTPPS3                          BANKMASK(INTPPS), 3
#define INTPPS4                          BANKMASK(INTPPS), 4
#define INTPPS5                          BANKMASK(INTPPS), 5
#define IOCAF0                           BANKMASK(IOCAF), 0
#define IOCAF1                           BANKMASK(IOCAF), 1
#define IOCAF2                           BANKMASK(IOCAF), 2
#define IOCAF3                           BANKMASK(IOCAF), 3
#define IOCAF4                           BANKMASK(IOCAF), 4
#define IOCAF5                           BANKMASK(IOCAF), 5
#define IOCAF6                           BANKMASK(IOCAF), 6
#define IOCAF7                           BANKMASK(IOCAF), 7
#define IOCAN0                           BANKMASK(IOCAN), 0
#define IOCAN1                           BANKMASK(IOCAN), 1
#define IOCAN2                           BANKMASK(IOCAN), 2
#define IOCAN3                           BANKMASK(IOCAN), 3
#define IOCAN4                           BANKMASK(IOCAN), 4
#define IOCAN5                           BANKMASK(IOCAN), 5
#define IOCAN6                           BANKMASK(IOCAN), 6
#define IOCAN7                           BANKMASK(IOCAN), 7
#define IOCAP0                           BANKMASK(IOCAP), 0
#define IOCAP1                           BANKMASK(IOCAP), 1
#define IOCAP2                           BANKMASK(IOCAP), 2
#define IOCAP3                           BANKMASK(IOCAP), 3
#define IOCAP4                           BANKMASK(IOCAP), 4
#define IOCAP5                           BANKMASK(IOCAP), 5
#define IOCAP6                           BANKMASK(IOCAP), 6
#define IOCAP7                           BANKMASK(IOCAP), 7
#define IOCBF0                           BANKMASK(IOCBF), 0
#define IOCBF1                           BANKMASK(IOCBF), 1
#define IOCBF2                           BANKMASK(IOCBF), 2
#define IOCBF3                           BANKMASK(IOCBF), 3
#define IOCBF4                           BANKMASK(IOCBF), 4
#define IOCBF5                           BANKMASK(IOCBF), 5
#define IOCBF6                           BANKMASK(IOCBF), 6
#define IOCBF7                           BANKMASK(IOCBF), 7
#define IOCBN0                           BANKMASK(IOCBN), 0
#define IOCBN1                           BANKMASK(IOCBN), 1
#define IOCBN2                           BANKMASK(IOCBN), 2
#define IOCBN3                           BANKMASK(IOCBN), 3
#define IOCBN4                           BANKMASK(IOCBN), 4
#define IOCBN5                           BANKMASK(IOCBN), 5
#define IOCBN6                           BANKMASK(IOCBN), 6
#define IOCBN7                           BANKMASK(IOCBN), 7
#define IOCBP0                           BANKMASK(IOCBP), 0
#define IOCBP1                           BANKMASK(IOCBP), 1
#define IOCBP2                           BANKMASK(IOCBP), 2
#define IOCBP3                           BANKMASK(IOCBP), 3
#define IOCBP4                           BANKMASK(IOCBP), 4
#define IOCBP5                           BANKMASK(IOCBP), 5
#define IOCBP6                           BANKMASK(IOCBP), 6
#define IOCBP7                           BANKMASK(IOCBP), 7
#define IOCCF0                           BANKMASK(IOCCF), 0
#define IOCCF1                           BANKMASK(IOCCF), 1
#define IOCCF2                           BANKMASK(IOCCF), 2
#define IOCCF3                           BANKMASK(IOCCF), 3
#define IOCCF4                           BANKMASK(IOCCF), 4
#define IOCCF5                           BANKMASK(IOCCF), 5
#define IOCCF6                           BANKMASK(IOCCF), 6
#define IOCCF7                           BANKMASK(IOCCF), 7
#define IOCCN0                           BANKMASK(IOCCN), 0
#define IOCCN1                           BANKMASK(IOCCN), 1
#define IOCCN2                           BANKMASK(IOCCN), 2
#define IOCCN3                           BANKMASK(IOCCN), 3
#define IOCCN4                           BANKMASK(IOCCN), 4
#define IOCCN5                           BANKMASK(IOCCN), 5
#define IOCCN6                           BANKMASK(IOCCN), 6
#define IOCCN7                           BANKMASK(IOCCN), 7
#define IOCCP0                           BANKMASK(IOCCP), 0
#define IOCCP1                           BANKMASK(IOCCP), 1
#define IOCCP2                           BANKMASK(IOCCP), 2
#define IOCCP3                           BANKMASK(IOCCP), 3
#define IOCCP4                           BANKMASK(IOCCP), 4
#define IOCCP5                           BANKMASK(IOCCP), 5
#define IOCCP6                           BANKMASK(IOCCP), 6
#define IOCCP7                           BANKMASK(IOCCP), 7
#define IOCEF3                           BANKMASK(IOCEF), 3
#define IOCEN3                           BANKMASK(IOCEN), 3
#define IOCEP3                           BANKMASK(IOCEP), 3
#define IOCIE                            BANKMASK(PIE0), 4
#define IOCIF                            BANKMASK(PIR0), 4
#define IOCMD                            BANKMASK(PMD0), 5
#define IPEN                             BANKMASK(ADCON1), 6
#define ISM0                             BANKMASK(CWG1ISM), 0
#define ISM1                             BANKMASK(CWG1ISM), 1
#define ISM2                             BANKMASK(CWG1ISM), 2
#define ISM3                             BANKMASK(CWG1ISM), 3
#define ISM4                             BANKMASK(CWG1ISM), 4
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA3                            BANKMASK(LATA), 3
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LATA6                            BANKMASK(LATA), 6
#define LATA7                            BANKMASK(LATA), 7
#define LATB0                            BANKMASK(LATB), 0
#define LATB1                            BANKMASK(LATB), 1
#define LATB2                            BANKMASK(LATB), 2
#define LATB3                            BANKMASK(LATB), 3
#define LATB4                            BANKMASK(LATB), 4
#define LATB5                            BANKMASK(LATB), 5
#define LATB6                            BANKMASK(LATB), 6
#define LATB7                            BANKMASK(LATB), 7
#define LATC0                            BANKMASK(LATC), 0
#define LATC1                            BANKMASK(LATC), 1
#define LATC2                            BANKMASK(LATC), 2
#define LATC3                            BANKMASK(LATC), 3
#define LATC4                            BANKMASK(LATC), 4
#define LATC5                            BANKMASK(LATC), 5
#define LATC6                            BANKMASK(LATC), 6
#define LATC7                            BANKMASK(LATC), 7
#define LENDIAN                          BANKMASK(CRCCON0), 1
#define LFOEN                            BANKMASK(OSCEN), 4
#define LFOR                             BANKMASK(OSCSTAT), 4
#define LSAC0                            BANKMASK(CWG1AS0), 2
#define LSBD0                            BANKMASK(CWG1AS0), 4
#define LSBD1                            BANKMASK(CWG1AS0), 5
#define LSCA1                            BANKMASK(CWG1AS0), 3
#define LTH0                             BANKMASK(ADLTHL), 0
#define LTH1                             BANKMASK(ADLTHL), 1
#define LTH10                            BANKMASK(ADLTHH), 2
#define LTH11                            BANKMASK(ADLTHH), 3
#define LTH12                            BANKMASK(ADLTHH), 4
#define LTH13                            BANKMASK(ADLTHH), 5
#define LTH14                            BANKMASK(ADLTHH), 6
#define LTH15                            BANKMASK(ADLTHH), 7
#define LTH2                             BANKMASK(ADLTHL), 2
#define LTH3                             BANKMASK(ADLTHL), 3
#define LTH4                             BANKMASK(ADLTHL), 4
#define LTH5                             BANKMASK(ADLTHL), 5
#define LTH6                             BANKMASK(ADLTHL), 6
#define LTH7                             BANKMASK(ADLTHL), 7
#define LTH8                             BANKMASK(ADLTHH), 0
#define LTH9                             BANKMASK(ADLTHH), 1
#define LTHR                             BANKMASK(ADSTAT), 5
#define LWLO                             BANKMASK(NVMCON1), 5
#define MATH                             BANKMASK(ADSTAT), 4
#define MD0                              BANKMASK(ADCON2), 0
#define MD1                              BANKMASK(ADCON2), 1
#define MD16                             BANKMASK(T0CON0), 4
#define MD2                              BANKMASK(ADCON2), 2
#define MFOEN                            BANKMASK(OSCEN), 5
#define MFOR                             BANKMASK(OSCSTAT), 5
#define MPWM1EN                          BANKMASK(PWMEN), 0
#define MPWM1LD                          BANKMASK(PWMLOAD), 0
#define MPWM2EN                          BANKMASK(PWMEN), 1
#define MPWM2LD                          BANKMASK(PWMLOAD), 1
#define MPWM3EN                          BANKMASK(PWMEN), 2
#define MPWM3LD                          BANKMASK(PWMLOAD), 2
#define MPWM4EN                          BANKMASK(PWMEN), 3
#define MPWM4LD                          BANKMASK(PWMLOAD), 3
#define MSK01                            BANKMASK(SSP1ADD), 0
#define MSK02                            BANKMASK(SSP2ADD), 0
#define MSK11                            BANKMASK(SSP1ADD), 1
#define MSK12                            BANKMASK(SSP2ADD), 1
#define MSK21                            BANKMASK(SSP1ADD), 2
#define MSK22                            BANKMASK(SSP2ADD), 2
#define MSK31                            BANKMASK(SSP1ADD), 3
#define MSK32                            BANKMASK(SSP2ADD), 3
#define MSK41                            BANKMASK(SSP1ADD), 4
#define MSK42                            BANKMASK(SSP2ADD), 4
#define MSK51                            BANKMASK(SSP1ADD), 5
#define MSK52                            BANKMASK(SSP2ADD), 5
#define MSK61                            BANKMASK(SSP1ADD), 6
#define MSK62                            BANKMASK(SSP2ADD), 6
#define MSK71                            BANKMASK(SSP1ADD), 7
#define MSK72                            BANKMASK(SSP2ADD), 7
#define MSSP1MD                          BANKMASK(PMD3), 3
#define MSSP2MD                          BANKMASK(PMD3), 4
#define NCH3                             BANKMASK(ADNCH), 3
#define NCH4                             BANKMASK(ADNCH), 4
#define NCH5                             BANKMASK(ADNCH), 5
#define NCO1ACC0                         BANKMASK(NCO1ACCL), 0
#define NCO1ACC1                         BANKMASK(NCO1ACCL), 1
#define NCO1ACC10                        BANKMASK(NCO1ACCH), 2
#define NCO1ACC11                        BANKMASK(NCO1ACCH), 3
#define NCO1ACC12                        BANKMASK(NCO1ACCH), 4
#define NCO1ACC13                        BANKMASK(NCO1ACCH), 5
#define NCO1ACC14                        BANKMASK(NCO1ACCH), 6
#define NCO1ACC15                        BANKMASK(NCO1ACCH), 7
#define NCO1ACC16                        BANKMASK(NCO1ACCU), 0
#define NCO1ACC17                        BANKMASK(NCO1ACCU), 1
#define NCO1ACC18                        BANKMASK(NCO1ACCU), 2
#define NCO1ACC19                        BANKMASK(NCO1ACCU), 3
#define NCO1ACC2                         BANKMASK(NCO1ACCL), 2
#define NCO1ACC3                         BANKMASK(NCO1ACCL), 3
#define NCO1ACC4                         BANKMASK(NCO1ACCL), 4
#define NCO1ACC5                         BANKMASK(NCO1ACCL), 5
#define NCO1ACC6                         BANKMASK(NCO1ACCL), 6
#define NCO1ACC7                         BANKMASK(NCO1ACCL), 7
#define NCO1ACC8                         BANKMASK(NCO1ACCH), 0
#define NCO1ACC9                         BANKMASK(NCO1ACCH), 1
#define NCO1CKS0                         BANKMASK(NCO1CLK), 0
#define NCO1CKS1                         BANKMASK(NCO1CLK), 1
#define NCO1CKS2                         BANKMASK(NCO1CLK), 2
#define NCO1CKS3                         BANKMASK(NCO1CLK), 3
#define NCO1EN                           BANKMASK(NCO1CON), 7
#define NCO1IE                           BANKMASK(PIE4), 0
#define NCO1IF                           BANKMASK(PIR4), 0
#define NCO1INC0                         BANKMASK(NCO1INCL), 0
#define NCO1INC1                         BANKMASK(NCO1INCL), 1
#define NCO1INC10                        BANKMASK(NCO1INCH), 2
#define NCO1INC11                        BANKMASK(NCO1INCH), 3
#define NCO1INC12                        BANKMASK(NCO1INCH), 4
#define NCO1INC13                        BANKMASK(NCO1INCH), 5
#define NCO1INC14                        BANKMASK(NCO1INCH), 6
#define NCO1INC15                        BANKMASK(NCO1INCH), 7
#define NCO1INC16                        BANKMASK(NCO1INCU), 0
#define NCO1INC17                        BANKMASK(NCO1INCU), 1
#define NCO1INC18                        BANKMASK(NCO1INCU), 2
#define NCO1INC19                        BANKMASK(NCO1INCU), 3
#define NCO1INC2                         BANKMASK(NCO1INCL), 2
#define NCO1INC3                         BANKMASK(NCO1INCL), 3
#define NCO1INC4                         BANKMASK(NCO1INCL), 4
#define NCO1INC5                         BANKMASK(NCO1INCL), 5
#define NCO1INC6                         BANKMASK(NCO1INCL), 6
#define NCO1INC7                         BANKMASK(NCO1INCL), 7
#define NCO1INC8                         BANKMASK(NCO1INCH), 0
#define NCO1INC9                         BANKMASK(NCO1INCH), 1
#define NCO1MD                           BANKMASK(PMD2), 3
#define NCO1OUT                          BANKMASK(NCO1CON), 5
#define NCO1PFM                          BANKMASK(NCO1CON), 0
#define NCO1POL                          BANKMASK(NCO1CON), 4
#define NCO1PWS0                         BANKMASK(NCO1CLK), 5
#define NCO1PWS1                         BANKMASK(NCO1CLK), 6
#define NCO1PWS2                         BANKMASK(NCO1CLK), 7
#define NDIV0                            BANKMASK(OSCCON1), 0
#define NDIV1                            BANKMASK(OSCCON1), 1
#define NDIV2                            BANKMASK(OSCCON1), 2
#define NDIV3                            BANKMASK(OSCCON1), 3
