garyPenhook/PIC-Assembler/device_includes/pic16f18156.inc
#define WDTSEN                           BANKMASK(WDTCON0), 0
#define WDTSTATE                         BANKMASK(WDTTMR), 2
#define WDTTMR0                          BANKMASK(WDTTMR), 3
#define WDTTMR1                          BANKMASK(WDTTMR), 4
#define WDTTMR2                          BANKMASK(WDTTMR), 5
#define WDTTMR3                          BANKMASK(WDTTMR), 6
#define WDTTMR4                          BANKMASK(WDTTMR), 7
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2
#define WINDOW0                          BANKMASK(WDTCON1), 0
#define WINDOW1                          BANKMASK(WDTCON1), 1
#define WINDOW2                          BANKMASK(WDTCON1), 2
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WPUA6                            BANKMASK(WPUA), 6
#define WPUA7                            BANKMASK(WPUA), 7
#define WPUB0                            BANKMASK(WPUB), 0
#define WPUB1                            BANKMASK(WPUB), 1
#define WPUB2                            BANKMASK(WPUB), 2
#define WPUB3                            BANKMASK(WPUB), 3
#define WPUB4                            BANKMASK(WPUB), 4
#define WPUB5                            BANKMASK(WPUB), 5
#define WPUB6                            BANKMASK(WPUB), 6
#define WPUB7                            BANKMASK(WPUB), 7
#define WPUC0                            BANKMASK(WPUC), 0
#define WPUC1                            BANKMASK(WPUC), 1
#define WPUC2                            BANKMASK(WPUC), 2
#define WPUC3                            BANKMASK(WPUC), 3
#define WPUC4                            BANKMASK(WPUC), 4
#define WPUC5                            BANKMASK(WPUC), 5
#define WPUC6                            BANKMASK(WPUC), 6
#define WPUC7                            BANKMASK(WPUC), 7
#define WPUE3                            BANKMASK(WPUE), 3
#define WR                               BANKMASK(NVMCON1), 1
#define WREN                             BANKMASK(NVMCON1), 2
#define WRERR                            BANKMASK(NVMCON1), 3
#define XOR0                             BANKMASK(CRCXORL), 0
#define XOR1                             BANKMASK(CRCXORL), 1
#define XOR10                            BANKMASK(CRCXORH), 2
#define XOR11                            BANKMASK(CRCXORH), 3
#define XOR12                            BANKMASK(CRCXORH), 4
#define XOR13                            BANKMASK(CRCXORH), 5
#define XOR14                            BANKMASK(CRCXORH), 6
#define XOR15                            BANKMASK(CRCXORH), 7
#define XOR16                            BANKMASK(CRCXORU), 0
#define XOR17                            BANKMASK(CRCXORU), 1
#define XOR18                            BANKMASK(CRCXORU), 2
#define XOR19                            BANKMASK(CRCXORU), 3
#define XOR2                             BANKMASK(CRCXORL), 2
#define XOR20                            BANKMASK(CRCXORU), 4
#define XOR21                            BANKMASK(CRCXORU), 5
#define XOR22                            BANKMASK(CRCXORU), 6
#define XOR23                            BANKMASK(CRCXORU), 7
#define XOR24                            BANKMASK(CRCXORT), 0
#define XOR25                            BANKMASK(CRCXORT), 1
#define XOR26                            BANKMASK(CRCXORT), 2
#define XOR27                            BANKMASK(CRCXORT), 3
#define XOR28                            BANKMASK(CRCXORT), 4
#define XOR29                            BANKMASK(CRCXORT), 5
#define XOR3                             BANKMASK(CRCXORL), 3
#define XOR30                            BANKMASK(CRCXORT), 6
#define XOR31                            BANKMASK(CRCXORT), 7
#define XOR4                             BANKMASK(CRCXORL), 4
#define XOR5                             BANKMASK(CRCXORL), 5
#define XOR6                             BANKMASK(CRCXORL), 6
#define XOR7                             BANKMASK(CRCXORL), 7
#define XOR8                             BANKMASK(CRCXORH), 0
#define XOR9                             BANKMASK(CRCXORH), 1
#define ZCDIE                            BANKMASK(PIE6), 2
#define ZCDIF                            BANKMASK(PIR6), 2
#define ZCDINTN                          BANKMASK(ZCDCON), 0
#define ZCDINTP                          BANKMASK(ZCDCON), 1
#define ZCDMD                            BANKMASK(PMD4), 4
#define ZCDOUT                           BANKMASK(ZCDCON), 5
#define ZCDPOL                           BANKMASK(ZCDCON), 4
#define ZCDSEN                           BANKMASK(ZCDCON), 7
#define ZERO                             BANKMASK(STATUS), 2
#define nADDRESS1                        BANKMASK(SSP1STAT), 5
#define nADDRESS2                        BANKMASK(SSP2STAT), 5
#define nBOR                             BANKMASK(PCON0), 0
#define nMEMV                            BANKMASK(PCON1), 1
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON0), 1
#define nRI                              BANKMASK(PCON0), 2
#define nRMCLR                           BANKMASK(PCON0), 3
#define nRWDT                            BANKMASK(PCON0), 4
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nT3SYNC                          BANKMASK(T3CON), 2
#define nTO                              BANKMASK(STATUS), 4
#define nWDTWV                           BANKMASK(PCON0), 5
#define nWRITE1                          BANKMASK(SSP1STAT), 2
#define nWRITE2                          BANKMASK(SSP2STAT), 2

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec
psect udata_bank13,class=BANK13,space=SPACE_DATA,noexec
psect udata_bank14,class=BANK14,space=SPACE_DATA,noexec
psect udata_bank15,class=BANK15,space=SPACE_DATA,noexec
psect udata_bank16,class=BANK16,space=SPACE_DATA,noexec
psect udata_bank17,class=BANK17,space=SPACE_DATA,noexec
psect udata_bank18,class=BANK18,space=SPACE_DATA,noexec
psect udata_bank19,class=BANK19,space=SPACE_DATA,noexec
psect udata_bank20,class=BANK20,space=SPACE_DATA,noexec
psect udata_bank21,class=BANK21,space=SPACE_DATA,noexec
psect udata_bank22,class=BANK22,space=SPACE_DATA,noexec
psect udata_bank23,class=BANK23,space=SPACE_DATA,noexec
psect udata_bank24,class=BANK24,space=SPACE_DATA,noexec
psect udata_bank25,class=BANK25,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC16F18156_INC_
